w-dee/esp-np2kai/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Verified with esp-emu v0.39.0, which reports ESP32-P4 revision v3.1.
# Physical P4-NANO and TAB5 revision compatibility remains unverified.
CONFIG_ESP32P4_REV_MIN_301=y

# Phase 3: enable the pinned ESP-IDF PSRAM heap and external BSS support.
# Keep the P4 mode/speed defaults from ESP-IDF 5.5.4.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Phase 3.5: the raw NP2TEST fixture extends the emulator flash image beyond
# the default 2 MiB single-app layout.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
